#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
random_string.jwt_refresh_secret: Refreshing state... [id=i4rc2qqdt1s5eis46qg8e4j87viwjw7y48llwg28rj8g4d09c9rjfv99uli10auy]
module.naming.random_string.main: Refreshing state... [id=19b26bhv528tnt4xl65snt12fytp2g0h29cuwfh81qokvr9fyorytc2uzzw3]
module.naming.random_string.first_letter: Refreshing state... [id=t]
random_string.jwt_secret: Refreshing state... [id=44xc913iy4n52rsmmc6c68jaxip8rdllibjzw70lqxjzov4cmb5zwa2a20nymrq8]
random_string.meilisearch_master_key: Refreshing state... [id=KTOc4BimBbVSWlZznSS5OXGgDBhaKJ5n]
random_string.creds_key: Refreshing state... [id=p1dupueqe7l5jpzq2l3jjtqre4y0rzngidzdrxn5mj5hrhwroo2xxf3f441was8x]
random_string.creds_iv: Refreshing state... [id=hu2hwuva570qi3n0etsavmx1r9lz9979]
random_string.cosmosdb_root_password: Refreshing state... [id=l9i2orqxyep059z04lfe5chzq1t9r4w0]
data.cloudflare_zone.default: Reading...
data.cloudflare_zone.default: Read complete after 0s
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWU5YmQxZi0yNzViLTRjMmQtYjYxNS0yZjUwYzI0Mjc5Nzk7b2JqZWN0SWQ9N2EyNzhlYjEtNzQ1ZC00OWY5LWFiYzktNzAzZDExMjRlNmE0O3N1YnNjcmlwdGlvbklkPThiZThjNzA0LWEzMGItNDUxNy05MmIxLTU0Mjk5MWE0ZDExYTt0ZW5hbnRJZD1mMTg0N2MyNy05MGJlLTRiMzgtYTFiNy1iZDNhMjAyOTEyMmY=]
azurerm_resource_group.core: Refreshing state... [id=/subscriptions/8be8c704-a30b-4517-92b1-542991a4d11a/resourceGroups/rg-openai]
azurerm_container_app_environment.librechat: Refreshing state... [id=/subscriptions/8be8c704-a30b-4517-92b1-542991a4d11a/resourceGroups/rg-openai/providers/Microsoft.App/managedEnvironments/ca-openai]
azurerm_cognitive_account.openai: Refreshing state... [id=/subscriptions/8be8c704-a30b-4517-92b1-542991a4d11a/resourceGroups/rg-openai/providers/Microsoft.CognitiveServices/accounts/cog-openai]
azurerm_cosmosdb_account.librechat: Refreshing state... [id=/subscriptions/8be8c704-a30b-4517-92b1-542991a4d11a/resourceGroups/rg-openai/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-openai]
azurerm_cognitive_deployment.azure_openai_models["o1"]: Refreshing state... [id=/subscriptions/8be8c704-a30b-4517-92b1-542991a4d11a/resourceGroups/rg-openai/providers/Microsoft.CognitiveServices/accounts/cog-openai/deployments/o1]
azurerm_cognitive_deployment.azure_openai_models["gpt-4o-mini"]: Refreshing state... [id=/subscriptions/8be8c704-a30b-4517-92b1-542991a4d11a/resourceGroups/rg-openai/providers/Microsoft.CognitiveServices/accounts/cog-openai/deployments/gpt-4o-mini]
azurerm_cognitive_deployment.azure_openai_models["gpt-4o"]: Refreshing state... [id=/subscriptions/8be8c704-a30b-4517-92b1-542991a4d11a/resourceGroups/rg-openai/providers/Microsoft.CognitiveServices/accounts/cog-openai/deployments/gpt-4o]
azurerm_cognitive_deployment.azure_openai_models["o3-mini"]: Refreshing state... [id=/subscriptions/8be8c704-a30b-4517-92b1-542991a4d11a/resourceGroups/rg-openai/providers/Microsoft.CognitiveServices/accounts/cog-openai/deployments/o3-mini]
azurerm_container_app.librechat: Refreshing state... [id=/subscriptions/8be8c704-a30b-4517-92b1-542991a4d11a/resourceGroups/rg-openai/providers/Microsoft.App/containerApps/ca-openai]
azurerm_container_app_custom_domain.librechat: Refreshing state... [id=/subscriptions/8be8c704-a30b-4517-92b1-542991a4d11a/resourceGroups/rg-openai/providers/Microsoft.App/containerApps/ca-openai/customDomainName/chat.philipwelz.cloud]
cloudflare_dns_record.verification: Refreshing state... [id=b71bf1d07707a7a4163ad107350a8076]
cloudflare_dns_record.librechat: Refreshing state... [id=bb2d0f7d18c4ec789028cbebf4e7163e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_dns_record.librechat will be updated in-place
  ~ resource "cloudflare_dns_record" "librechat" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-02-03T00:20:30Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "bb2d0f7d18c4ec789028cbebf4e7163e"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-02-03T00:20:30Z" -> (known after apply)
      ~ name                = (sensitive value)
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.verification will be updated in-place
  ~ resource "cloudflare_dns_record" "verification" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-02-03T00:20:30Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "b71bf1d07707a7a4163ad107350a8076"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-02-03T00:20:30Z" -> (known after apply)
      ~ name                = "asuid.chat.philipwelz.cloud" -> "asuid.chat"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: ./tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "./tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @renovate-bot-pw[bot], Action: `pull_request`, Workflow: `TF validation`*